Richter3d/fluid/constant/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RK4fluidSolver RK4Fluid;
// fluidSolver pisoFluid;

RK4FluidCoeffs
{
    nCorrectors 10;
    nNonOrthogonalCorrectors 0;
}

consistentIcoFluidCoeffs
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
}

pisoFluidCoeffs
{
    nCorrectors     8;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
