Richter3d/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Level 0
// y = 0, z = 0
    (0 0 0)
    (0.95 0 0)
    (1.05 0 0)
    (2.01 0 0)

// y = 0, z = -0.2
    (0 0 -0.2)
    (0.95 0 -0.2)
    (1.05 0 -0.2)
    (2.01 0 -0.2)

// y = 0, z = -0.6
    (0 0 -0.6)
    (0.95 0 -0.6)
    (1.05 0 -0.6)
    (2.01 0 -0.6)

// y = 0, z = -0.81
    (0 0 -0.81)
    (0.95 0 -0.81)
    (1.05 0 -0.81)
    (2.01 0 -0.81) 

//Level 1
// y = 0.2, z = 0
    (0 0.2 0)
    (0.95 0.2 0)
    (1.05 0.2 0)
    (2.01 0.2 0)

// y = 0.2, z = -0.2
    (0 0.2 -0.2)
    (0.95 0.2 -0.2)
    (1.05 0.2 -0.2)
    (2.01 0.2 -0.2)

// y = 0.2, z = -0.6
    (0 0.2 -0.6)
    (0.95 0.2 -0.6)
    (1.05 0.2 -0.6)
    (2.01 0.2 -0.6)

// y = 0.2, z = -0.81
    (0 0.2 -0.81)
    (0.95 0.2 -0.81)
    (1.05 0.2 -0.81)
    (2.01 0.2 -0.81) 

//Level 2
// y = 0.4, z = 0
    (0 0.4 0)
    (0.95 0.4 0)
    (1.05 0.4 0)
    (2.01 0.4 0)

// y = 0.4, z = -0.2
    (0 0.4 -0.2)
    (0.95 0.4 -0.2)
    (1.05 0.4 -0.2)
    (2.01 0.4 -0.2)

// y = 0.4, z = -0.6
    (0 0.4 -0.6)
    (0.95 0.4 -0.6)
    (1.05 0.4 -0.6)
    (2.01 0.4 -0.6)

// y = 0.4, z = -0.81
    (0 0.4 -0.81)
    (0.95 0.4 -0.81)
    (1.05 0.4 -0.81)
    (2.01 0.4 -0.81)

);

blocks
(
    hex (4 5 21 20 0 1 17 16) (95 20 20) simpleGrading (1 1 1)
    hex (5 6 22 21 1 2 18 17) (10 20 20) simpleGrading (1 1 1)
    hex (6 7 23 22 2 3 19 18) (96 20 20) simpleGrading (1 1 1)
    hex (20 21 37 36 16 17 33 32) (95 20 20) simpleGrading (1 1 1)
    hex (21 22 38 37 17 18 34 33) (10 20 20) simpleGrading (1 1 1)
    hex (22 23 39 38 18 19 35 34) (96 20 20) simpleGrading (1 1 1)
//   
    hex (8 9 25 24 4 5 21 20) (95 20 40) simpleGrading (1 1 1)
    hex (10 11 27 26 6 7 23 22) (96 20 40) simpleGrading (1 1 1)
    hex (24 25 41 40 20 21 37 36) (95 20 40) simpleGrading (1 1 1)
    hex (25 26 42 41 21 22 38 37) (10 20 40) simpleGrading (1 1 1)
    hex (26 27 43 42 22 23 39 38) (96 20 40) simpleGrading (1 1 1)
//   
    hex (12 13 29 28 8 9 25 24) (95 20 20) simpleGrading (1 1 1)
    hex (13 14 30 29 9 10 26 25) (10 20 20) simpleGrading (1 1 1)
    hex (14 15 31 30 10 11 27 26) (96 20 20) simpleGrading (1 1 1)
    hex (28 29 45 44 24 25 41 40) (95 20 20) simpleGrading (1 1 1)
    hex (29 30 46 45 25 26 42 41) (10 20 20) simpleGrading (1 1 1)
    hex (30 31 47 46 26 27 43 42) (96 20 20) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (4 0 16 20)
        (8 4 20 24)
        (12 8 24 28)
        (20 16 32 36)
        (24 20 36 40)
        (28 24 40 44)
    )
    patch outlet
    (
        (3 7 23 19)
        (7 11 27 23)
        (11 15 31 27)
        (19 23 39 35)
        (23 27 43 39)
        (27 31 47 43)
    )
    wall top
    (
        (32 33 37 36)
        (36 37 41 40)
        (40 41 45 44)
        (33 34 38 37)
        (37 38 42 41)
        (41 42 46 45)
        (34 35 39 38)
        (38 39 43 42)
        (42 43 47 46)
    )
    wall bottom
    (
        (1 0 4 5)
        (5 4 8 9)
        (9 8 12 13)
        (2 1 5 6)
        (10 9 13 14)
        (3 2 6 7)
        (7 6 10 11)
        (11 10 14 15)
    )
    wall nearSide
    (
        (0 1 17 16)
        (1 2 18 17)
        (2 3 19 18)
        (16 17 33 32)
        (17 18 34 33)
        (18 19 35 34)
    )
    wall farSide
    (
        (13 12 28 29)
        (14 13 29 30)
        (15 14 30 31)
        (29 28 44 45)
        (30 29 45 46)
        (31 30 46 47)
    )
    wall interface
    (
        (5 9 25 21)
        (10 6 22 26)
        (21 22 26 25)
        (6 5 21 22)
        (9 10 26 25)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
