Richter3d/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fsiRK4Foam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3; //4;

deltaT          0.00025;

writeControl    timeStep;

writeInterval   40; //100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

functions
(
   beamReport
   {
       type pointHistory;
       functionObjectLibs
       (
         "libpointHistory.so"
       );

       refHistoryPoint (0.95 0.15 -0.35);

       region solid;
   }

   setInletVelocity
   {
       type setInletVelocity;
       functionObjectLibs
       (
         "libsetInletVelocity.so"
       );
   }

   forces
   {
       type                forces;
       functionObjectLibs  ( "libforces.so" );
       outputControl       timeStep;
       outputInterval      1;
       patches             (interface);
       pName               p;
       UName               U;
       rhoName             rhoInf;
       log                 true;
       rhoInf              1000;
       CofR                (1 0.1 -0.4);
   }

);


// ************************************************************************* //
