Richter3d/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //default   Euler;
    //default     backward;
    default CrankNicolson 0.9; 
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default         none;
    div(U)          Gauss linear;
//    div(phi,U)    Gauss linearUpwind cellLimited Gauss linear 1;
    div(phi,U)      Gauss filteredLinear2   1   0;
    div(B)          Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default                 Gauss   linear  orthogonal;
    laplacian(nu,U)         Gauss   linear  skewCorrected 1;
    laplacian((1|A(U)),p)   Gauss   linear  skewCorrected 1;
    laplacian(diffusivity,cellMotionU) Gauss linear skewCorrected 1;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
